_posts/2015-01-26-Lisp-Learning.html
---
layout: post
title: Lisp Learning
tag: [Lisp]
description: [Yeh. From today. I begin my black magic learning]
---

<p>
Since I use <b>eshell</b> for daily work, maybe it's a good time to learn
lisp coding, because eshell can parse it!!!
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 1. BigBang</h2>
<div class="outline-text-2" id="text-1">
<p>
Invoke lisp interpreter in Emacs: M-X ielm.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2. Basic</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 2.1 create a list</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>use ' before bracket.
</li>
<li>use <b>list</b> function.
</li>
<li>cons
</li>
</ol>

<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (list "helo" (+ 1 1) "wold")
("helo" 2 "wold")

ELISP&gt; '("helo" (+ 1 1) "wold")
("helo"
 (+ 1 1)
 "wold")

ELISP&gt; (cons 'a (cons (cons (+ 1 1) 'b) 'c))
(a
 (2 . b)
 . c)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 2.2 operate a list</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (third (cons 'a (cons (cons (+ 1 1) 'b) '(c d e))))
a
ELISP&gt; (cdr (cons 'a (cons (cons (+ 1 1) 'b) '(c d e))))
((2 . b)
 c d e)

ELISP&gt; (third (cons 'a (cons (cons (+ 1 1) 'b) '(c d e))))
c
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 2.3 if/else</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (if (listp (list 1)) (+ 11 1) (- 1 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 2.4 and/or</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (and (+ 1 1) 27 "a" (/ 3.0 2))
1.5
ELISP&gt; (or nil 2 nil 1)
2 (#o2, #x2, ?\C-b)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 2.5 define function</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (defun lxcomp (a b)
	    (&gt; a b))
lxcomp
ELISP&gt; (lxcomp 2 3)
t
ELISP&gt; (lxcomp 2 3)
nil
ELISP&gt;
</pre>
</div>

<p>
recursive function
</p>
<div class="org-src-container">

<pre class="src src-lisp">ELISP&gt; (defun in_list (obj lst)
	 (if (null lst)
	     nil
	   (if (eql obj (car lst))
	       lst
	     (in_list obj (cdr lst)))))
in_list
ELISP&gt; (in_list 'y '(a b c x y z))
(y z)
</pre>
</div>
</div>
</div>
</div>
